In [1]:
import sqlite3
sqlite3.version

'2.6.0'

In [2]:
conn = sqlite3.connect('test2.db')

In [3]:
cur = conn.cursor()

In [4]:
cur.execute("DROP TABLE IF EXISTS person")
cur.execute('''
           CREATE TABLE person (
            id integer primary key autoincrement,
            name text not null,
            hakbun integer,
            address text)
            ''')

In [5]:
cur.execute('''INSERT INTO person (name, hakbun, address) 
            VALUES ('kim', 1234, 'seoul')''')

In [8]:
cur.execute("SELECT * FROM person")
rows = cur.fetchall() 
rows

[(1, 'kim', 1234, 'seoul')]

### 변수로 데이터를 입력하기 (Insert)

In [10]:
new_name = 'park'
new_hakbun = 1234 
new_address = 'Seoul'

cur.execute('''INSERT INTO person (name, hakbun, address) 
            VALUES (?, ?, ?)''', (new_name, new_hakbun, new_address))

In [11]:
### 조회 
cur.execute("SELECT * FROM person")
rows = cur.fetchall() 
rows

[(1, 'kim', 1234, 'seoul'), (2, 'park', 1234, 'Seoul')]

In [13]:
cur.execute("SELECT * FROM person")
cur.fetchall()

[(1, 'kim', 1234, 'seoul'), (2, 'park', 1234, 'Seoul')]

In [16]:
for r in rows:
    print(r[1], r[2])

kim 1234
park 1234

In [17]:
for r in rows:
    print('{0}번째 학생의 이름은 {1}이고, 학번은 {2} 입니다.'.format(r[0],r[1],r[2]))

1번째 학생의 이름은 kim이고, 학번은 1234 입니다.
2번째 학생의 이름은 park이고, 학번은 1234 입니다.

In [18]:
### 특정행만 가져오기(WHERE)
cur.execute("SELECT * FROM person WHERE id=1")
cur.fetchall()

[(1, 'kim', 1234, 'seoul')]

In [20]:
new_id = '2'
cur.execute("SELECT * FROM person WHERE id=?",new_id)
cur.fetchall()

[(2, 'park', 1234, 'Seoul')]

In [22]:
### 특정값 변경 (Update)
cur.execute("UPDATE person SET address='Pusan' WHERE id=1")
cur.execute("SELECT * FROM person WHERE id=1")
cur.fetchall()

[(1, 'kim', 1234, 'Pusan')]

In [24]:
### 삭제(Delete)
cur.execute("DELETE FROM person WHERE id = 1")
cur.execute("SELECT * FROM person")
cur.fetchall()

[(2, 'park', 1234, 'Seoul')]

### pandas와 연계

In [25]:
import pandas as pd

In [26]:
sql = pd.read_sql_query('SELECT * FROM person', conn)
df = pd.DataFrame(sql, columns=['id','name','hakbun','address'])
df

   id  name  hakbun address
0   2  park    1234   Seoul

In [28]:
type(sql)

pandas.core.frame.DataFrame

In [29]:
type(rows)

list

In [33]:
df.to_sql('newtable2', conn, index=None)

In [34]:
cur.execute("SELECT * FROM newtable2")
cur.fetchall()

[(2, 'park', 1234, 'Seoul')]

In [35]:
df.to_csv('newfile.csv')

In [36]:
### 작업후에 꼭 DB닫기 
conn.commit()  # 여태까지 변경내용을 영구적으로 기록 
conn.close()